; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared1 - mode
	spectrograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation5 - direction
	Star3 - direction
	Star4 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(pointing satellite2 Planet9)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 spectrograph0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 infrared1)
	(have_image Star10 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star0 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star0)
   goals met: 0 of 7
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite2 phenomenon8 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon8)
   goals met: 0 of 7
5. (take_image satellite2 phenomenon8 instrument3 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 7
7. (turn_to satellite0 phenomenon7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 7
8. (take_image satellite2 phenomenon7 instrument3 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 3 of 7
9. (turn_to satellite2 planet6 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet6)
   goals met: 3 of 7
10. (take_image satellite2 planet6 instrument3 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 4 of 7
11. (turn_to satellite2 star10 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star10)
   goals met: 4 of 7
12. (take_image satellite2 star10 instrument3 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 5 of 7
13. (turn_to satellite2 planet9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet9)
   goals met: 6 of 7
14. (take_image satellite2 planet9 instrument3 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 7 of 7
